// Эта функция существует до ее создания. Она существует в коде независимо и может быть объявлена раньше, чем создана.
// Например:
const hello = firstFunc();

// Или
firstFunc();

// Так же функция может становиться методом.
const pit = "";
pit.firstFunc();

// Сама функция
function firstFunc() {
  console.log("Привет");
}

///////////////////////////////////////////////////////////////////////////////////////////////////

// Вторая функция может объявляться только после ее создания. Она записывается сразу в переменную.
let bye = function () {
  console.log("Пока");
};
// В данном случае функция становиться методом переменной roma:
const roma = "";
roma.bye();
// Или
bye();

////////////////////////////////////////////////////////////////////////////////////////////////////

// Стрелочная функция. Просто намного проще писать код.

const calc = (a, b) => a + b;
